In [2]:
import numpy as np
import pandas as pd

![image.png]()

In [9]:
df_student_test_math_data = pd.DataFrame({'student':['Tom','Jack','Dan','Ram','Jeff','David'],
                                         'ID':[10,56,31,85,9,22]
                                         })

In [10]:
df_student_test_science_data = pd.DataFrame({'student':['Tom','Ram','David'],
                                            'ID':[100,850,202]
                                            })

In [6]:
pd.merge(left=df_student_test_math_data,
         right=df_student_test_science_data)  #  INNER merge

Empty DataFrame
Columns: [student, ID]
Index: []

In [7]:
pd.merge(left=df_student_test_math_data,
         right=df_student_test_science_data,
         on='student') # inner

  student  ID_x  ID_y
0     Tom    10   100
1     Ram    85   850
2   David    22   202

In [19]:
math= pd.DataFrame({'learners':['Tom','Jack','Dan','Ram','Jeff','David'],
                                         'number':[10,56,31,85,9,22]})

scien= pd.DataFrame({'student':['Tom','Ram','David','python'],
                                            'ID':[10,85,22,999999]})

In [35]:
def fn2():
  return 'cake'

In [36]:
pd.merge(left=math,
         right=scien,
         left_on='learners', right_on='student',how='outer').fillna(fn2())

  learners number student      ID
0      Tom     10     Tom      10
1     Jack     56    cake    cake
2      Dan     31    cake    cake
3      Ram     85     Ram      85
4     Jeff      9    cake    cake
5    David     22   David      22
6     cake   cake  python  999999

In [29]:
pd.merge(left=math,
         right=scien,
         left_on='learners', right_on='student',how='left')

  learners  number student    ID
0      Tom      10     Tom  10.0
1     Jack      56     NaN   NaN
2      Dan      31     NaN   NaN
3      Ram      85     Ram  85.0
4     Jeff       9     NaN   NaN
5    David      22   David  22.0

In [20]:
pd.merge(left=math,
         right=scien,
         left_on='learners', right_on='student',how='right')

  learners  number student      ID
0      Tom    10.0     Tom      10
1      Ram    85.0     Ram      85
2    David    22.0   David      22
3      NaN     NaN  python  999999

In [ ]:
(pd.merge(df_student_test_math_data,df_student_test_science_data,on='ID',how='left')).fillna('X')

   ID student_x student_y
0  10       Tom       Tom
1  56      Jack         X
2  31       Dan         X
3  85       Ram       Ram
4   9      Jeff         X
5  22     David     David

In [ ]:
pd.merge(df_student_test_math_data,df_student_test_science_data,on='ID',how='outer')

   ID student_x student_y
0  10       Tom       Tom
1  56      Jack       NaN
2  31       Dan       NaN
3  85       Ram       Ram
4   9      Jeff       NaN
5  22     David     David

In [54]:
math= pd.DataFrame({'student':['Tom','Jack','Dan','Ram','Jeff','David'],
                                         'ID':[10,56,31,85,9,22]
                    })

scien= pd.DataFrame({'student':['Tom','Ram','David','python'],
                                            'number':[10,85,22,999999],
                     'city':['abc','pqr','xyz','lmn']})

In [55]:
pd.concat([scien, math], axis=0) # Row wise cocatination -- row wise of stacking  -- look for column names

  student    number city    ID
0     Tom      10.0  abc   NaN
1     Ram      85.0  pqr   NaN
2   David      22.0  xyz   NaN
3  python  999999.0  lmn   NaN
0     Tom       NaN  NaN  10.0
1    Jack       NaN  NaN  56.0
2     Dan       NaN  NaN  31.0
3     Ram       NaN  NaN  85.0
4    Jeff       NaN  NaN   9.0
5   David       NaN  NaN  22.0

In [50]:
pd.concat([scien, math], axis = 1,join='inner')  # pasted parallely  -- inner -- Looked for index values

  student      ID student  ID
0     Tom      10     Tom  10
1     Ram      85    Jack  56
2   David      22     Dan  31
3  python  999999     Ram  85

In [56]:
pd.concat([math, scien],ignore_index=True)

  student    ID    number city
0     Tom  10.0       NaN  NaN
1    Jack  56.0       NaN  NaN
2     Dan  31.0       NaN  NaN
3     Ram  85.0       NaN  NaN
4    Jeff   9.0       NaN  NaN
5   David  22.0       NaN  NaN
6     Tom   NaN      10.0  abc
7     Ram   NaN      85.0  pqr
8   David   NaN      22.0  xyz
9  python   NaN  999999.0  lmn

In [ ]:
df_student_survey_data = pd.DataFrame({'student':['Tom','Jack','Tom','Ram','Jeff','Jack'],
                                         'ID':[10,56,10,85,9,56]
                                         })

In [ ]:
df_student_survey_data

   ID student
0  10     Tom
1  56    Jack
2  10     Tom
3  85     Ram
4   9    Jeff
5  56    Jack

In [ ]:
df_student_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [ ]:
df_student_survey_data.drop_duplicates()

   ID student
0  10     Tom
1  56    Jack
3  85     Ram
4   9    Jeff

In [ ]:
df_student_survey_data.drop_duplicates(['student'])

   ID student
0  10     Tom
1  56    Jack
3  85     Ram
4   9    Jeff

In [ ]:
df_student_survey_data.drop_duplicates('ID')

   ID student
0  10     Tom
1  56    Jack
3  85     Ram
4   9    Jeff